import {DictionaryType} from './DictionaryType';

export const DicOrderStatus : DictionaryType = {
  iw: {
    // Groups
    g0: 'פתוחה',
    g1: 'מאושרת סופית',
    g2: 'סגורה',
    g3: 'מבוטלת',
    // Customer view
    c0: 'טיוטה',
    c10: 'נשלחה לספק',
    c11: 'נשלחה לספק (נערכה)',
    c20: 'נפתחה ע"י הספק וטרם אושרה',
    c30: 'אישור ראשוני',
    c31: 'אישור ראשוני עם שינויים',
    c21: 'נערכה ע"י הלקוח לאחר אישור ראשוני',
    c80: 'אושרה סופית',
    c81: 'אושרה סופית עם שינויים',
    c401: 'בוטלה ע"י הספק',
    c402: 'בוטלה ע"י הלקוח',
    c100: 'סגורה',
    // Supplier view
    s10: 'הזמנה חדשה',
    s11: 'הזמנה חדשה',
    s20: 'הזמנה חדשה',
    s21: 'שונתה ע"י הלקוח',
    s30: 'אישור ראשוני',
    s31: 'אישור ראשוני עם שינויים',
    s80: 'אושרה סופית',
    s81: 'אושרה סופית עם שינויים',
    s401: 'בוטלה ע"י הספק',
    s402: 'בוטלה ע"י הלקוח',
    s100: 'סגורה',
  }
};
